Revit 2027 API
UndoOperation Enumeration
 The operation associated with DocumentChanged event
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum UndoOperation
Public Enumeration UndoOperation
public enum class UndoOperation
type UndoOperation
Members
Member name | Value | Description
TransactionCommitted | 0 |  A transaction was committed
TransactionGroupRolledBack | 2 |  A transaction group was rolled back
TransactionRedone | 4 |  A transaction was redone
TransactionRolledBack | 1 |  A transaction was rolled back
TransactionUndone | 3 |  A transaction was undone
See Also
Reference
Autodesk.Revit.DB.Events Namespace